# CannotRemoveMembersInCircuitHavingParent Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..CannotRemoveMembersInCircuitHavingParent Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
You have selected elements that are connected to a Panel object in a Circuit. These elements cannot be removed from the Circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotRemoveMembersInCircuitHavingParent { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotRemoveMembersInCircuitHavingParent As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotRemoveMembersInCircuitHavingParent {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace